app/Helpers/base_helper.php

function generateTransactionId()
{

    $txnid = substr(hash('sha256', mt_rand() . microtime()), 0, 20);

    $db = \Config\Database::connect();

    $builder = $db->table('payment_log');

    $query = $builder->select('*')->where(array('TxnId' => $txnid))->get();
---
SELECT *
FROM `payment_log`
WHERE `TxnId` = '5a4635d7d9b621b665e2'

function get_review_count($id)
{
    $db = \Config\Database::connect();
    $builder = $db->table('review');
    $builder->select('round(AVG(`rating`)) as rateavg');
    $builder->where('product_id', $id);
    $builder->where('is_delete', 0);
    $query = $builder->get();
---
SELECT round(AVG(`rating`)) as rateavg
FROM `review`
WHERE `product_id` = '26'
AND `is_delete` = 0

function get_review_total($id)
{
    $db = \Config\Database::connect();
    $builder = $db->table('review');
    $builder->select('SUM(`rating`) as ratesum');
    $builder->where('product_id', $id);
    $builder->where('is_delete', 0);
    $query = $builder->get();
---
SELECT SUM(`rating`) as ratesum
FROM `review`
WHERE `product_id` = '26'
AND `is_delete` = 0

function mail_template($ord_id)
{
    /**
     * goto order table get all order info
     * goto cl_order_items to get all order item info
     * @return string
     */
    //  print_r($ord_id);exit;

    $db      = \Config\Database::connect();
    $builder = $db->table('orders o');
    $builder->select('o.*,sum(o.total_payment) as grandtotal');
    $builder->where('o.id', $ord_id);
    $query  = $builder->get();
    $order = $query->getRow();
    // echo"<pre>";print_r($order);exit;
    if ($order->default_add != 0)  //check session isset login user if not then call guest user
    {
        $builder = $db->table('user');
        $builder->select('*');
        $builder->where('id', $order->default_add);
        $query    = $builder->get();
---
SELECT `o`.*, sum(o.total_payment) as grandtotal
FROM `orders` `o`
WHERE `o`.`id` = '17'
SELECT *
FROM `user`
WHERE `id` = '1'