app/Helpers/rozorpay_helper.php

UPDATE `payment_log` SET `OrderID` = 'order_KMu5B2TsVW78vl'
WHERE `TxnId` = '5a4635d7d9b621b665e2'
---
    function SendRazor($amount_r, $txnid_r, $shipping_detail)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('payment_log');
        if (!empty($shipping_detail)) {
            $email    = $shipping_detail['email'];
            $phone    = $shipping_detail['contact'];
            $username = $shipping_detail['username'];
        } else {
            $email    = '';
            $phone    = '';
            $username = '';
        }
        $txnid       = $txnid_r;
        // print_r($txnid);exit;
        $amount      = floatval($amount_r);
        //  print_r($amount);exit;

        $productinfo = 'Goods Charge';
        $ordreid     = generate_order_id_razor($amount_r, $txnid_r);
        if ($ordreid != '0') {
            $data['OrderID'] = $ordreid;
            $builder->where(array(
                'TxnId' => $txnid
            ));
            $result_update = $builder->update($data);

UPDATE `payment_log` SET `PaymentInProccesing` = 0, `PaymentFailed` = 1, `PaymentSuccess` = 0, `PaymentDetail` = 'Transaction has been tampered. Please try again!!', `UpdateTime` = '2022-09-29 07:23:56', `UpdateBy` = '1'
WHERE `TxnId` = 'e2c36c3b1cb679d21256'
---
            $db      = \Config\Database::connect();
            $builder = $db->table('payment_log');
            $builder->where('TxnId', $txn);
            $builder->update($data);

UPDATE `payment_log` SET `PatmentExecute` = 1, `UpdateTime` = '2022-09-30 05:28:04', `UpdateBy` = NULL
WHERE `TxnId` = '025ef6709e0812f082fc'
---
    function PaymentExecute($txn)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('payment_log');
        $builder->select('*');
        $builder->where(array(
            'TxnId' => $txn
        ));
        $query  = $builder->get();
        $result = $query->getRow();
        //    echo '<pre>'; print_r($result);exit;
        if (!empty($result)) {
            if ($result->PaymentSuccess == 0) {
        //    echo '<pre>'; print_r($result);exit;
                $data = array(
                    "PatmentExecute" => 1,
                    "UpdateTime" => date("Y-m-d H:i:s"),
                    "UpdateBy" => @$result->user_id
                );
                $builder->where(array(
                    'TxnId' => $txn
                ));
                $builder->update($data);

UPDATE `cart` SET `is_delete` = '1'
WHERE `user_id` = '1'
---
                $ret         = $query->getResult();
                $Userbuilder = $db->table('cart');
                $Userbuilder->where('user_id', $ret[0]->user_id);
                $Userbuilder->update(array(
                    'is_delete' => '1'
                ));

SELECT *
FROM `orders`
WHERE `id` = '17'
---
                $db      = \Config\Database::connect();
                $builder = $db->table('orders');
                $builder->select('*');
                $builder->where('id', $result->ord_id);

SELECT `email`
FROM `user`
WHERE `id` = '1'
---
                {
                    $builder = $db->table('user');
                    $builder->select('email');
                    $builder->where('id', $order->default_add);