app/Models/HomeModel.php

    public function get_randomitem_data()
    {
        $db = $this->db;
        $builder = $db->table('item i');
        $builder->select('i.*,b.brand as brand_name,c.category as category_name');
        $builder->join('brand b', 'b.id=i.brand');
        $builder->join('category c', 'c.id=i.category');
        $builder->orderBy('i.id', 'RANDOM');
        $builder->where('i.is_delete', '0');
        $builder->limit(8);
        $query = $builder->get();
---
SELECT `i`.*, `b`.`brand` as `brand_name`, `c`.`category` as `category_name`
FROM `item` `i`
JOIN `brand` `b` ON `b`.`id`=`i`.`brand`
JOIN `category` `c` ON `c`.`id`=`i`.`category`
WHERE `i`.`is_delete` = '0'
ORDER BY RAND()
 LIMIT 8

    public function get_product_data($id)
    {
        $db = $this->db;
        $builder = $db->table('item i');
        $builder->select('i.*,b.brand as brand_name,c.category as category_name');
        $builder->join('brand b', 'b.id=i.brand');
        $builder->join('category c', 'c.id=i.category');
        $builder->where('i.id', $id);
        $builder->where('i.is_delete', 0);
        $query = $builder->get();
---
SELECT `i`.*, `b`.`brand` as `brand_name`, `c`.`category` as `category_name`
FROM `item` `i`
JOIN `brand` `b` ON `b`.`id`=`i`.`brand`
JOIN `category` `c` ON `c`.`id`=`i`.`category`
WHERE `i`.`id` = '16'
AND `i`.`is_delete` = 0

    public function get_randomslider_data()
    {
        $db = $this->db;
        $builder = $db->table('slider');
        $builder->select('*');
        // $builder->orderBy('id', 'desc');
        $builder->where('is_delete', '0');
        // $builder->limit(5);
        $query = $builder->get();
---
SELECT *
FROM `slider`
WHERE `is_delete` = '0'

    public function get_randombrand_data()
    {
        $db = $this->db;
        $builder = $db->table('brand');
        $builder->select('*');
        $builder->orderBy('id', 'RANDOM');
        $builder->where('is_delete', '0');
        // $builder->limit(8);
        $query = $builder->get();
---
SELECT *
FROM `brand`
WHERE `is_delete` = '0'
ORDER BY RAND()

    public function get_randomcategory_data()
    {
        $db = $this->db;
        $builder = $db->table('category');
        $builder->select('*');
        $builder->orderBy('id', 'desc');
        $builder->where('is_delete', '0');
        // $builder->limit(8);
        $query = $builder->get();
---
SELECT *
FROM `category`
WHERE `is_delete` = '0'
ORDER BY `id` DESC

    public function get_randomreview_data()
    {
        // print_r($id);exit;
        $db = $this->db;
        $builder = $db->table('review');
        $builder->select('*');
        $builder->orderBy('id', 'RANDOM');
        $builder->where('is_delete', 0);
        $query = $builder->get();
---
SELECT *
FROM `review`
WHERE `is_delete` = 0
ORDER BY RAND()

    public function get_order_data()
    {
        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date');
        // $builder->join('order_item oi', 'o.id = oi.order_id', 'left');
        // $builder->join('item i', 'i.id = oi.product_id', 'left');
        // $builder->join('category c','c.id=i.category');
        $builder->where('o.user_id', session('uid') ? session('uid') : session('guestid'));
        $query = $builder->get();
---
SELECT `o`.*, `o`.`created_at` as `order_date`
FROM `orders` `o`
WHERE `o`.`user_id` = '1'

    public function get_track_order_data($id)
    {
        //   echo "<pre>"; print_r($id);exit;

        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date');
        $builder->where('o.id', $id);
        $query = $builder->get();
---
SELECT `o`.*, `o`.`created_at` as `order_date`
FROM `orders` `o`
WHERE `o`.`id` = '1'

    public function get_order_details($id)
    {
        // print_r($id);exit;
        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date,oi.*,i.*,i.name as item_name');
        $builder->join('order_item oi', 'o.id = oi.order_id', 'left');
        $builder->join('item i', 'i.id = oi.product_id');
        $builder->where('o.id', $id);
        $query = $builder->get();
        $order_detail1 = $query->getRowArray();
        // echo"<pre>";print_r($order_detail1);exit;

        // $order_detail1['order_date'] = $order_detail1['created_at'];
        if ($order_detail1['default_add'] != 0) {
            $db = $this->db;
            $builder = $db->table('user u');
            $builder->select('u.*,s.sname as state_name,c.cname as city_name');
            $builder->join('cities c', 'c.id=u.city');
            $builder->join('states s', 's.id=u.state');
            $builder->where('u.id', $order_detail1['default_add']);
            $builder->where('u.is_delete', 0);
            $query = $builder->get();
---
SELECT `o`.*, `o`.`created_at` as `order_date`, `oi`.*, `i`.*, `i`.`name` as `item_name`
FROM `orders` `o`
LEFT JOIN `order_item` `oi` ON `o`.`id` = `oi`.`order_id`
JOIN `item` `i` ON `i`.`id` = `oi`.`product_id`
WHERE `o`.`id` = '9'
SELECT `u`.*, `s`.`sname` as `state_name`, `c`.`cname` as `city_name`
FROM `user` `u`
JOIN `cities` `c` ON `c`.`id`=`u`.`city`
JOIN `states` `s` ON `s`.`id`=`u`.`state`
WHERE `u`.`id` = '5'
AND `u`.`is_delete` = 0

    public function get_master_data($method, $id)
    {
        $db = $this->db;
        $data = array();
        if ($method == 'address') {
            $builder = $db->table('user ');
            $builder->select('*,"default" as type');
            $builder->where('id', session('uid'));
            $builder->where('is_delete', 0);
            $builder->limit(1);
            $query = $builder->get();
            $result = $query->getResultArray();

            $builder = $db->table('shipping_address a');
            $builder->select('a.*,c.cname,s.sname,"shipping" as type');
            $builder->join('cities c', 'c.id=a.city', 'left');
            $builder->join('states s', 's.id=a.state', 'left');
            $builder->where('user_id', session('uid') ? session('uid') : session('guestid'));
            $builder->where('a.is_delete', 0);
            $query = $builder->get();
---
SELECT `u`.*, `s`.`sname` as `state_name`, `c`.`cname` as `city_name`
FROM `user` `u`
JOIN `cities` `c` ON `c`.`id`=`u`.`city`
JOIN `states` `s` ON `s`.`id`=`u`.`state`
WHERE `u`.`id` = '1'
AND `u`.`is_delete` = 0

    public function get_states($post)
    {
        // echo"<pre>";print_r($post);exit;
        $db = $this->db;
        $builder = $db->table('states');
        $builder->select('id,sname');
        $builder->like('sname', (@$post['searchTerm']) ? @$post['searchTerm'] : '');
        $builder->limit(50);
        $query = $builder->get();
---
SELECT `id`, `sname`
FROM `states`
WHERE `sname` LIKE '%%' ESCAPE '!'
 LIMIT 50

    public function get_brand($get)
    {

        $db = $this->db;
        $builder = $db->table('brand');
        $builder->select('id,brand');

        if (!empty($post)) {
            $builder->like('brand', (@$get['searchTerm']) ? @$get['searchTerm'] : '');
        }

        $builder->where('is_delete', 0);
        // $builder->limit(3);
        $query = $builder->get();
---
SELECT `id`, `brand`
FROM `brand`
WHERE `is_delete` = 0

    public function get_category($get)
    {

        $db = $this->db;
        $builder = $db->table('category');
        $builder->select('id,category');

        if (!empty($post)) {
            $builder->like('category', (@$get['searchTerm']) ? @$get['searchTerm'] : '');
        }

        $builder->where('is_delete', 0);
        // $builder->limit(3);
        $query = $builder->get();
---
SELECT `id`, `category`
FROM `category`
WHERE `is_delete` = 0

    public function get_review($id)
    {
        // print_r($id);exit;
        $db = $this->db;
        $builder = $db->table('review');
        $builder->select('*');
        $builder->where('product_id', $id);
        $builder->where('is_delete', 0);
        $query = $builder->get();
---
SELECT *
FROM `review`
WHERE `product_id` = '24'
AND `is_delete` = 0

    public function get_related_product_data($cid)
    {
        // print_r($cid);exit;
        $db = $this->db;
        $builder = $db->table('item');
        $builder->select('*');
        $builder->orderBy('id', 'RANDOM');
        $builder->where('category', $cid);
        // $builder->limit(4);
        $query = $builder->get();
---
SELECT *
FROM `item`
WHERE `category` = '1'
ORDER BY RAND()

    public function UpdateData($post)
    {
        // print_r($post);exit;

        $result = array();
        $db = $this->db;
        if ($post['type'] == 'Remove') {

            if ($post['method'] == 'cart') {
                $builder = $db->table('cart');
                $builder->where("id", @$post['pk']);
                $result = $builder->update(array('is_delete' => '1'));
                $result = array('st' => 'success');
            }
            if ($post['method'] == 'wishlist') {
                $builder = $db->table('wishlist');
                $builder->where("id", @$post['pk']);
                $result = $builder->update(array('is_delete' => '1'));
                $result = array('st' => 'success');
            }
            if ($post['method'] == 'address') {
                $builder = $db->table('shipping_address');
                $builder->where("id", @$post['pk']);
                $result = $builder->update(array('is_delete' => '1'));
---
UPDATE `shipping_address` SET `is_delete` = '1'
WHERE `id` = '14'

    public function get_address_data()
    {
        $db = $this->db;
        $builder = $db->table('user u');
        $builder->select('u.*,s.sname as state_name,c.cname as city_name');
        $builder->join('cities c', 'c.id=u.city');
        $builder->join('states s', 's.id=u.state');
        $builder->where('u.id', session('uid'));
        $builder->where('u.is_delete', 0);
        $query = $builder->get();
        $result1 = $query->getResultArray();

        $builder = $db->table('shipping_address a');
        $builder->select('a.*,s.sname as state_name,c.cname as city_name,a.fname as name');
        $builder->join('cities c', 'c.id=a.city');
        $builder->join('states s', 's.id=a.state');
        $builder->where('a.user_id', session('uid') ? session('uid') : session('guestid'));
        $builder->where('a.is_delete', 0);
        $query = $builder->get();
---
SELECT `u`.*, `s`.`sname` as `state_name`, `c`.`cname` as `city_name`
FROM `user` `u`
JOIN `cities` `c` ON `c`.`id`=`u`.`city`
JOIN `states` `s` ON `s`.`id`=`u`.`state`
WHERE `u`.`id` = '5'
AND `u`.`is_delete` = 0
SELECT `a`.*, `s`.`sname` as `state_name`, `c`.`cname` as `city_name`, `a`.`fname` as `name`
FROM `shipping_address` `a`
JOIN `cities` `c` ON `c`.`id`=`a`.`city`
JOIN `states` `s` ON `s`.`id`=`a`.`state`
WHERE `a`.`user_id` = '5'
AND `a`.`is_delete` = 0

    public function payment_data($post)
    {
        // echo "<pre>";
        // print_r($post);
        // exit;
        if (!empty($post['add2'])) {
            $ship_id = $post['id'];
            $default_add = 0;
        } else {
            $ship_id = 0;
            $default_add = session('uid') ? session('uid') : '';
        }

        $db = $this->db;
        $builder = $db->table('orders');
        $order_data = array(
            'user_id' => session('uid') ? session('uid') : session('guestid'),
            'sub_total' => $post['sub_total'],
            'tax_amt' => $post['tax_amt'],
            'coupon-discount' => $post['coupon-discount'],
            'total_payment' => $post['grand_total'],
            'ship_id' => $ship_id,
            'default_add' => $default_add,
            'payment_type' => 'Razorpay',
            'is_login' => session('uid') ? 0 : 1
        );
        $order_data['created_at'] = date('Y-m-d H:i:s');
        $order_data['created_by'] = session('uid') ? session('uid') : session('guestid');
        $result = $builder->insert($order_data);
---
INSERT INTO `orders` (`user_id`, `sub_total`, `tax_amt`, `coupon-discount`, `total_payment`, `ship_id`, `default_add`, `payment_type`, `is_login`, `created_at`, `created_by`) VALUES ('5', '396', '47.52', '0', '443.52', 0, '5', 'Razorpay', 0, '2022-09-27 06:11:55', '5')

                'price' => $post['price'][$i],
                'total' => $post['sub'][$i]
            );
            $result = $builder->insert($order_item);
---
INSERT INTO `order_item` (`order_id`, `user_id`, `quantity`, `product_id`, `price`, `total`) VALUES (12, '5', '1', '24', '396', '396')

    public function send_otp_mail($post)
    {
        helper('base');
        $db = $this->db;
        $builder = $db->table('user');
        $builder->select('*');
        $builder->where(array("email" => $post['email']));
        $result = $builder->get();
---
SELECT *
FROM `user`
WHERE `email` = 'maithili.Koffeekodes@gmail.com'