app/Models/HomeModel.php

SELECT *
FROM `banner`
WHERE `is_delete` = '0'
---
    public function get_banner_data()
    {
        $db = $this->db;
        $builder = $db->table('banner');
        $builder->select('*');
        // $builder->orderBy('id', 'desc');
        $builder->where('is_delete', '0');
        $query = $builder->get();

SELECT *
FROM `cart`
WHERE `user_id` = '1'
AND `product_id` = '26 '
AND `is_delete` = 0
---
    public function insert_cart_data($post)
    {
        // echo "<pre>";print_r($post);exit;
        $db = $this->db;
        $builder = $db->table("cart");
        $builder->select('*');
        $builder->where(array('user_id' => session('uid') ? session('uid') : session('guestid'), 'product_id' => $post['product_id'], 'is_delete' => 0));
        $query =  $builder->get();

SELECT `o`.*, `o`.`created_at` as `order_date`
FROM `orders` `o`
WHERE `o`.`user_id` = '1'
---
    public function get_order_data()
    {
        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date');
        // $builder->join('order_item oi', 'o.id = oi.order_id', 'left');
        // $builder->join('item i', 'i.id = oi.product_id', 'left');
        // $builder->join('category c','c.id=i.category');
        $builder->where('o.user_id', session('uid') ? session('uid') : session('guestid'));
        $query = $builder->get();

SELECT `o`.*, `o`.`created_at` as `order_date`, `oi`.*, `i`.*, `i`.`name` as `item_name`
FROM `orders` `o`
LEFT JOIN `order_item` `oi` ON `o`.`id` = `oi`.`order_id`
JOIN `item` `i` ON `i`.`id` = `oi`.`product_id`
WHERE `o`.`id` = '13'
---
    public function get_order_details($id)
    {
        // print_r($id);exit;
        $db = $this->db;
        $builder = $db->table('orders o');
        $builder->select('o.*,o.created_at as order_date,oi.*,i.*,i.name as item_name');
        $builder->join('order_item oi', 'o.id = oi.order_id', 'left');
        $builder->join('item i', 'i.id = oi.product_id');
        $builder->where('o.id', $id);
        $query = $builder->get();

SELECT *
FROM `coupon`
WHERE `coupon_code` = 'FirstCo35'
---
    public function applycoupon($post)
    {
        // print_r($post);exit;
        $db = $this->db;
        $builder = $db->table('coupon');
        $builder->select('*');
        $builder->where('coupon_code', $post['coupon']);
        $query = $builder->get();

SELECT MAX(listedprice) as max_value
FROM `item`
WHERE `is_delete` = 0
---
    public function get_max_val()
    {
        $db = $this->db;
        $builder = $db->table('item');
        $builder->select('MAX(listedprice) as max_value');
        $builder->where('is_delete', 0);
        $query = $builder->get();