app/Models/HomeModel.php

    public function top_rated_data()
    {
      $db = $this->db;
      $builder = $db->table('item i');
      $builder->select('i.*,r.rating');
      $builder->join('review r', 'i.id = r.product_id', 'left');
      $builder->groupBy('i.id');
      $builder->having('AVG(r.rating) >= 4');
      $builder->limit(3);
      $query = $builder->get();
---
SELECT `i`.*, `r`.`rating`
FROM `item` `i`
LEFT JOIN `review` `r` ON `i`.`id` = `r`.`product_id`
GROUP BY `i`.`id`
HAVING AVG(r.rating) >= 4
 LIMIT 3

    public function latest_product_data()
    {
      $db = $this->db;
      $builder = $db->table('item');
      $builder->select('*');
      $builder->orderBy('id', 'DESC');
      $builder->where('is_delete', '0');
      $builder->limit(8);
      $query = $builder->get();
---
SELECT *
FROM `item`
WHERE `is_delete` = '0'
ORDER BY `created_at` DESC
 LIMIT 8

    public function top_seller_data()
    {
      $db = $this->db;
      $builder = $db->table('order_item o');
      $builder->select('o.*,o.product_id, SUM(o.quantity) AS TotalQuantity,i.*');
      $builder->join('item i', 'i.id = o.product_id');
      $builder->groupBY('product_id');
      $builder->orderBy('SUM(o.quantity)', 'DESC');
      $builder->where('o.is_delete', '0');
      $builder->limit(8);
      $query = $builder->get();
---
SELECT *
FROM `item`
WHERE `is_delete` = '0'
ORDER BY `created_at` DESC
 LIMIT 8
SELECT `o`.*, `o`.`product_id`, SUM(o.quantity) AS TotalQuantity, `i`.*
FROM `order_item` `o`
JOIN `item` `i` ON `i`.`id` = `o`.`product_id`
WHERE `o`.`is_delete` = '0'
GROUP BY `product_id`
ORDER BY SUM(o.quantity) DESC
 LIMIT 8

    public function getaddress($post)
    {
        // echo"<pre>";print_r($post);exit;

        $db =  $this->db;
        $builder = $db->table('shipping_address a');
        $builder->select('a.*,s.sname as state_name,c.cname as city_name');
        $builder->join('cities c', 'c.id=a.city');
        $builder->join('states s', 's.id=a.state');
        $builder->where('a.id', $post['val']);
        $builder->where('a.is_delete', 0);
        $query = $builder->get();
---
SELECT `a`.*, `s`.`sname` as `state_name`, `c`.`cname` as `city_name`, `a`.`fname` as `name`
FROM `shipping_address` `a`
JOIN `cities` `c` ON `c`.`id`=`a`.`city`
JOIN `states` `s` ON `s`.`id`=`a`.`state`
WHERE `a`.`id` = '14'
AND `a`.`is_delete` = 0